antmicro/pigweed/targets/mimxrt595_evk_freertos/config/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC6 0x06u            /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SWO (coord N3), U7[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_SWO_PERIPHERAL SWD /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_SWO_SIGNAL SWO     /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_SWO_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWO_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SWO_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name FC12_TXD_SCL_MISO (coord N8), J27[2]/J43[5]/FXIO_D10
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_D10_PERIPHERAL FLEXCOMM12          /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_D10_SIGNAL TXD_SCL_MISO            /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_D10_PORT 4U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D10_PIN 30U                        /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D10_PIN_MASK (1U << 30U)           /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name FC12_RXD_SDA_MOSI (coord N10), J27[1]/J43[8]/FXIO_D11
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_D11_PERIPHERAL FLEXCOMM12          /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_D11_SIGNAL RXD_SDA_MOSI            /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_D11_PORT 4U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_D11_PIN 31U                        /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_D11_PIN_MASK (1U << 31U)           /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITM2UARTPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITM2UARTPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITM2UARTPINS_DEBUG_UART_TXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITM2UARTPINS_DEBUG_UART_TXD_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITM2UARTPINS_DEBUG_UART_TXD_PIN_MASK (1U << 1U)
/* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITM2UARTPINS_DEBUG_UART_RX_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITM2UARTPINS_DEBUG_UART_RX_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITM2UARTPINS_DEBUG_UART_RX_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITM2UARTPINS_DEBUG_UART_RX_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITM2UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 2U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitM2UARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI0_DATA0 (coord T15), U38[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_SIGNAL FLEXSPI_DATA0    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_SIGNAL FLEXSPI_DATA0
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PIN_MASK (1U << 20U)
/* @} */

