antmicro/pigweed/targets/mimxrt595_evk_freertos/config/pin_mux.h
/*! @name FLEXSPI0_DATA1 (coord T14), U38[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_SIGNAL FLEXSPI_DATA1    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_SIGNAL FLEXSPI_DATA1
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PIN_MASK (1U << 21U)
/* @} */

/*! @name FLEXSPI0_DATA2 (coord R13), U38[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_SIGNAL FLEXSPI_DATA2    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_SIGNAL FLEXSPI_DATA2
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PIN 22U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PIN_MASK (1U << 22U)
/* @} */

/*! @name FLEXSPI0_DATA3 (coord R12), U38[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_SIGNAL FLEXSPI_DATA3    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_SIGNAL FLEXSPI_DATA3
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PIN_MASK (1U << 23U)
/* @} */

/*! @name FLEXSPI0_DATA4 (coord N12), U38[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_SIGNAL FLEXSPI_DATA4    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_SIGNAL FLEXSPI_DATA4
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PIN 24U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PIN_MASK (1U << 24U)
/* @} */

/*! @name FLEXSPI0_DATA5 (coord R14), U38[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_SIGNAL FLEXSPI_DATA5    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_SIGNAL FLEXSPI_DATA5
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PIN 25U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PIN_MASK (1U << 25U)
/* @} */

/*! @name FLEXSPI0_DATA6 (coord P14), U38[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_SIGNAL FLEXSPI_DATA6    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_SIGNAL FLEXSPI_DATA6
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PIN_MASK (1U << 26U)
/* @} */

/*! @name FLEXSPI0_DATA7 (coord P13), U38[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_SIGNAL FLEXSPI_DATA7    /*!<@brief Signal name */
                                                                       /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_SIGNAL FLEXSPI_DATA7
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PIN 27U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PIN_MASK (1U << 27U)
/* @} */

/*! @name FLEXSPI0_SCLK (coord T17), U38[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PERIPHERAL FLEXSPI0    /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_SIGNAL FLEXSPI_SCLK    /*!<@brief Signal name */
                                                                     /* @} */
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_SIGNAL FLEXSPI_SCLK
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PIN 18U
/*!
 * @brief PORT pin mask */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PIN_MASK (1U << 18U)
/* @} */

/*! @name FLEXSPI0_SS0_N (coord U16), U38[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_SIGNAL FLEXSPI_SS0_N    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name FLEXSPI0_DQS (coord U14), U38[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PERIPHERAL FLEXSPI0   /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_SIGNAL FLEXSPI_DQS    /*!<@brief Signal name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPI0BPins(void); /* Function assigned for the Cortex-M33 */

